# PercentageSkylights Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..PercentageSkylights Property
EnergyDataSettings Class See Also
---
Used for the conceptual energy model. The approximate percentage of the building roof surfaces in massing instances for the Conceptual Energy Analytical Model.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double PercentageSkylights { get; set; }
```

Visual Basic
---
```text
Public Property PercentageSkylights As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double PercentageSkylights {
	double get ();
	void set (double value);
}
```

# Remarks
This value is used to automatically model the skylights in massing instances when the Energy Analytical model is being created.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The percentage skylights value is between 0.00 and 0.95. |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace